rails2/app/controllers/collections_controller.rb

  def index
    user_id = params[:id]
    if user_id.nil?
      @user = current_user
    else
      @user = User.find(user_id)
    end
    unless @user
      flash[:error] = "Please log in before viewing your collection."
      redirect_to root_path and return
    end

    @miniatures = Miniature.find(:all, :order => "release_id, number", :include => [:release])
    @total = @user.ownerships.sum(:have_count)
---
SELECT * FROM `releases` WHERE (`releases`.`id` IN (22,11,6,23,7,24,13,8,25,9,26,15,27,16,28,17,1,30,18,2,20,19,3,21,10,4,5))
SELECT * FROM `ownerships` WHERE (`ownerships`.user_id = 85)
SELECT sum(`ownerships`.have_count) AS sum_have_count FROM `ownerships` WHERE (`ownerships`.user_id = 85)