rails2/app/controllers/difficulties_controller.rb

SELECT * FROM `difficulties` WHERE (`difficulties`.`id` = 3)
---
  def show
    @difficulty = Difficulty.find(params[:id])