rails2/app/controllers/favorites_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 85) LIMIT 1
---
  def index
    user_id = params[:id]
    if user_id.nil?
      @user = current_user
    else
      @user = User.find(user_id)