rails2/app/controllers/miniatures_controller.rb

SELECT * FROM `miniatures` WHERE (`miniatures`.`id` = 1279)
SELECT * FROM `ownerships` WHERE (`ownerships`.`miniature_id` = '1265') AND (`ownerships`.user_id = 85) LIMIT 1
---
  def show
    @miniature = Miniature.find(params[:id])
    @comments = @miniature.comments
    @tags = @miniature.tags.sort_by {|tag| tag.name}
    @have_count = 0

    if logged_in?
      @ownership = current_user.ownerships.find_by_miniature_id(params[:id])