rails2/app/controllers/releases_controller.rb

SELECT * FROM `releases` WHERE (`releases`.`id` = 24) ORDER BY released_on desc
---
  def show
    @release = Release.find(params[:id])

SELECT * FROM `releases` WHERE (`releases`.`id` = 24) ORDER BY released_on desc
---
  def edit
    @release = Release.find(params[:id])

SELECT * FROM `releases` WHERE (`releases`.`id` = 24) ORDER BY released_on desc
UPDATE `releases` SET `updated_at` = '2010-10-07 02:12:33', `released_on` = '2009-08-06' WHERE `id` = 25
---
  def update
    @release = Release.find(params[:id])

    respond_to do |format|
      if @release.update_attributes(params[:release])