rails2/app/controllers/roles_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`id` = 3)
---
  def show
    @role = Role.find(params[:id])