rails2/app/controllers/search_controller.rb

  def by_name
    @name = params[:name] || ''

    if @name.length < 3
      flash[:error] = "Search terms must be at least 3 characters long."
    else
      @miniatures = Miniature.with_include.sorted(get_sort_field(params[:sort], "name")).search(@name)
---
SELECT * FROM `miniatures` WHERE (lower(miniatures.name) like '%kobold%') ORDER BY miniatures.name